src/main/resources/xml/GetAccountsGenderType/GetAccountsGenderType_soap1_1-request.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="https://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="https://www.w3.org/2001/XMLSchema"
               xmlns:soap="https://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <GetAccountsGenderType xmlns="https://tempuri.org/">
            <DocumentType>string</DocumentType>
            <DocumentNumber>string</DocumentNumber>
            <GenderType>string</GenderType>
            <AccountNumber>string</AccountNumber>
            <CardNumber>string</CardNumber>
            <web>string</web>
            <userId>string</userId>
            <programId>string</programId>
            <updateGender>string</updateGender>
        </GetAccountsGenderType>
    </soap:Body>
</soap:Envelope>


        <!--        POST /serviceconsulta.asmx HTTP/1.1-->
        <!--        Host: wscabalindividuosdev.cabal.coop-->
        <!--        Content-Type: text/xml; charset=utf-8-->
        <!--        Content-Length: length-->
        <!--        SOAPAction: "https://tempuri.org/GetAccountsGenderType"-->


<!--        HTTP/1.1 200 OK-->
<!--        Content-Type: text/xml; charset=utf-8-->
<!--        Content-Length: length-->
